SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32SPIN0260/MM32SPIN0260_Application/Device/MM32SPIN0260/Include/reg_adc.h
/**
  * @brief ADC_SMPR3 Register Bit Definition
  */
#define  ADC_SMPR3_SAMP16_Pos                     (0)
#define  ADC_SMPR3_SAMP16_Msk                     (0xFU << ADC_SMPR3_SAMP16_Pos)                    /*!<Channel6 Sample Time Selection*/
#define  ADC_SMPR3_SAMP16                         ADC_SMPR3_SAMP16_Msk
#define  ADC_SMPR3_SAMP16_Bit0                    (0x1U << ADC_SMPR3_SAMP16_Pos) 
#define  ADC_SMPR3_SAMP16_Bit1                    (0x2U << ADC_SMPR3_SAMP16_Pos) 
#define  ADC_SMPR3_SAMP16_Bit2                    (0x4U << ADC_SMPR3_SAMP16_Pos) 
#define  ADC_SMPR3_SAMP16_Bit3                    (0x8U << ADC_SMPR3_SAMP16_Pos) 
#define  ADC_SMPR3_SAMP17_Pos                     (4)
#define  ADC_SMPR3_SAMP17_Msk                     (0xFU << ADC_SMPR3_SAMP17_Pos)                    /*!<Channel15 Sample Time Selection*/
#define  ADC_SMPR3_SAMP17                         ADC_SMPR3_SAMP17_Msk
#define  ADC_SMPR3_SAMP17_Bit0                    (0x1U << ADC_SMPR3_SAMP17_Pos) 
#define  ADC_SMPR3_SAMP17_Bit1                    (0x2U << ADC_SMPR3_SAMP17_Pos) 
#define  ADC_SMPR3_SAMP17_Bit2                    (0x4U << ADC_SMPR3_SAMP17_Pos) 
#define  ADC_SMPR3_SAMP17_Bit3                    (0x8U << ADC_SMPR3_SAMP17_Pos) 

/**
  * @brief ADC_JOFR Register Bit Definition
  */
#define  ADC_JOFR_JOFFSET_Pos                     (0)
#define  ADC_JOFR_JOFFSET_Msk                     (0xFFFU << ADC_JOFR_JOFFSET_Pos)                  /*!<Data Offset Register for Injected Channel*/
#define  ADC_JOFR_JOFFSET                         ADC_JOFR_JOFFSET_Msk
#define  ADC_JOFR_JOFFSET_Bit0                    (0x001U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_Bit1                    (0x002U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_Bit2                    (0x004U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_Bit3                    (0x008U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_Bit4                    (0x010U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_Bit5                    (0x020U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_Bit6                    (0x040U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_Bit7                    (0x080U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_Bit8                    (0x100U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_Bit9                    (0x200U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_Bit10                   (0x400U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_Bit11                   (0x800U << ADC_JOFR_JOFFSET_Pos) 

/**
  * @brief ADC_JSQR Register Bit Definition
  */
#define  ADC_JSQR_JSQ0_Pos                        (0)
#define  ADC_JSQR_JSQ0_Msk                        (0x1FU << ADC_JSQR_JSQ0_Pos)                      /*!<0th Conversion for Injected Sequence*/
#define  ADC_JSQR_JSQ0                            ADC_JSQR_JSQ0_Msk
#define  ADC_JSQR_JSQ0_Bit0                       (0x01U << ADC_JSQR_JSQ0_Pos) 
#define  ADC_JSQR_JSQ0_Bit1                       (0x02U << ADC_JSQR_JSQ0_Pos) 
#define  ADC_JSQR_JSQ0_Bit2                       (0x04U << ADC_JSQR_JSQ0_Pos) 
#define  ADC_JSQR_JSQ0_Bit3                       (0x08U << ADC_JSQR_JSQ0_Pos) 
#define  ADC_JSQR_JSQ0_Bit4                       (0x10U << ADC_JSQR_JSQ0_Pos) 
#define  ADC_JSQR_JSQ1_Pos                        (5)
#define  ADC_JSQR_JSQ1_Msk                        (0x1FU << ADC_JSQR_JSQ1_Pos)                      /*!<1th Conversion for Injected Sequence*/
#define  ADC_JSQR_JSQ1                            ADC_JSQR_JSQ1_Msk
#define  ADC_JSQR_JSQ1_Bit0                       (0x01U << ADC_JSQR_JSQ1_Pos) 
#define  ADC_JSQR_JSQ1_Bit1                       (0x02U << ADC_JSQR_JSQ1_Pos) 
#define  ADC_JSQR_JSQ1_Bit2                       (0x04U << ADC_JSQR_JSQ1_Pos) 
#define  ADC_JSQR_JSQ1_Bit3                       (0x08U << ADC_JSQR_JSQ1_Pos) 
#define  ADC_JSQR_JSQ1_Bit4                       (0x10U << ADC_JSQR_JSQ1_Pos) 
#define  ADC_JSQR_JSQ2_Pos                        (10)
#define  ADC_JSQR_JSQ2_Msk                        (0x1FU << ADC_JSQR_JSQ2_Pos)                      /*!<2th Conversion for Injected Sequence*/
#define  ADC_JSQR_JSQ2                            ADC_JSQR_JSQ2_Msk
#define  ADC_JSQR_JSQ2_Bit0                       (0x01U << ADC_JSQR_JSQ2_Pos) 
#define  ADC_JSQR_JSQ2_Bit1                       (0x02U << ADC_JSQR_JSQ2_Pos) 
#define  ADC_JSQR_JSQ2_Bit2                       (0x04U << ADC_JSQR_JSQ2_Pos) 
#define  ADC_JSQR_JSQ2_Bit3                       (0x08U << ADC_JSQR_JSQ2_Pos) 
#define  ADC_JSQR_JSQ2_Bit4                       (0x10U << ADC_JSQR_JSQ2_Pos) 
#define  ADC_JSQR_JSQ3_Pos                        (15)
#define  ADC_JSQR_JSQ3_Msk                        (0x1FU << ADC_JSQR_JSQ3_Pos)                      /*!<3th Conversion for Injected Sequence*/
#define  ADC_JSQR_JSQ3                            ADC_JSQR_JSQ3_Msk
#define  ADC_JSQR_JSQ3_Bit0                       (0x01U << ADC_JSQR_JSQ3_Pos) 
#define  ADC_JSQR_JSQ3_Bit1                       (0x02U << ADC_JSQR_JSQ3_Pos) 
#define  ADC_JSQR_JSQ3_Bit2                       (0x04U << ADC_JSQR_JSQ3_Pos) 
#define  ADC_JSQR_JSQ3_Bit3                       (0x08U << ADC_JSQR_JSQ3_Pos) 
#define  ADC_JSQR_JSQ3_Bit4                       (0x10U << ADC_JSQR_JSQ3_Pos) 
#define  ADC_JSQR_JNUM_Pos                        (20)
#define  ADC_JSQR_JNUM_Msk                        (0x3U << ADC_JSQR_JNUM_Pos)                       /*!<Channel Number for Injected Sequence*/
#define  ADC_JSQR_JNUM                            ADC_JSQR_JNUM_Msk
#define  ADC_JSQR_JNUM_Bit0                       (0x1U << ADC_JSQR_JNUM_Pos) 
#define  ADC_JSQR_JNUM_Bit1                       (0x2U << ADC_JSQR_JNUM_Pos) 

/**
  * @brief ADC_JADDATA Register Bit Definition
  */
#define  ADC_JADDATA_JDATA_Pos                    (0)
#define  ADC_JADDATA_JDATA_Msk                    (0xFFFFU << ADC_JADDATA_JDATA_Pos)                /*!<Transfer Data for Injected Channels*/
#define  ADC_JADDATA_JDATA                        ADC_JADDATA_JDATA_Msk
#define  ADC_JADDATA_JDATA_Bit0                   (0x0001U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit1                   (0x0002U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit2                   (0x0004U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit3                   (0x0008U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit4                   (0x0010U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit5                   (0x0020U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit6                   (0x0040U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit7                   (0x0080U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit8                   (0x0100U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit9                   (0x0200U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit10                  (0x0400U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit11                  (0x0800U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit12                  (0x1000U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit13                  (0x2000U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit14                  (0x4000U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_Bit15                  (0x8000U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JCHANNELSEL_Pos              (16)
#define  ADC_JADDATA_JCHANNELSEL_Msk              (0x1FU << ADC_JADDATA_JCHANNELSEL_Pos)            /*!<Injected Channel Selection*/
#define  ADC_JADDATA_JCHANNELSEL                  ADC_JADDATA_JCHANNELSEL_Msk
#define  ADC_JADDATA_JCHANNELSEL_Bit0             (0x01U << ADC_JADDATA_JCHANNELSEL_Pos) 
#define  ADC_JADDATA_JCHANNELSEL_Bit1             (0x02U << ADC_JADDATA_JCHANNELSEL_Pos) 
#define  ADC_JADDATA_JCHANNELSEL_Bit2             (0x04U << ADC_JADDATA_JCHANNELSEL_Pos) 
#define  ADC_JADDATA_JCHANNELSEL_Bit3             (0x08U << ADC_JADDATA_JCHANNELSEL_Pos) 
#define  ADC_JADDATA_JCHANNELSEL_Bit4             (0x10U << ADC_JADDATA_JCHANNELSEL_Pos) 
#define  ADC_JADDATA_JOVERRUN_Pos                 (21)
#define  ADC_JADDATA_JOVERRUN_Msk                 (0x1U << ADC_JADDATA_JOVERRUN_Pos)                /*!<Overrun Flag for Injected Channels*/
#define  ADC_JADDATA_JOVERRUN                     ADC_JADDATA_JOVERRUN_Msk
#define  ADC_JADDATA_JVALID_Pos                   (22)
#define  ADC_JADDATA_JVALID_Msk                   (0x1U << ADC_JADDATA_JVALID_Pos)                  /*!<Valid Flag for Injected Channels*/
#define  ADC_JADDATA_JVALID                       ADC_JADDATA_JVALID_Msk

/**
  * @brief ADC_JDR Register Bit Definition
  */
#define  ADC_JDR_JDATA_Pos                        (0)
#define  ADC_JDR_JDATA_Msk                        (0xFFFFU << ADC_JDR_JDATA_Pos)                    /*!<Transfer Data for Injected Channels*/
#define  ADC_JDR_JDATA                            ADC_JDR_JDATA_Msk
#define  ADC_JDR_JDATA_Bit0                       (0x0001U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit1                       (0x0002U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit2                       (0x0004U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit3                       (0x0008U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit4                       (0x0010U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit5                       (0x0020U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit6                       (0x0040U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit7                       (0x0080U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit8                       (0x0100U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit9                       (0x0200U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit10                      (0x0400U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit11                      (0x0800U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit12                      (0x1000U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit13                      (0x2000U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit14                      (0x4000U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_Bit15                      (0x8000U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JOVERRUN_Pos                     (21)
#define  ADC_JDR_JOVERRUN_Msk                     (0x1U << ADC_JDR_JOVERRUN_Pos)                    /*!<Overrun Flag for Injected Channels*/
#define  ADC_JDR_JOVERRUN                         ADC_JDR_JOVERRUN_Msk
#define  ADC_JDR_JVALID_Pos                       (22)
#define  ADC_JDR_JVALID_Msk                       (0x1U << ADC_JDR_JVALID_Pos)                      /*!<Valid Flag for Injected Channels*/
#define  ADC_JDR_JVALID                           ADC_JDR_JVALID_Msk

/**
  * @brief ADC_LDATA Register Bit Definition
  */
#define  ADC_LDATA_LDATA_Pos                      (0)
#define  ADC_LDATA_LDATA_Msk                      (0xFFFFU << ADC_LDATA_LDATA_Pos)                  /*!<Last Conversion Data*/
#define  ADC_LDATA_LDATA                          ADC_LDATA_LDATA_Msk
#define  ADC_LDATA_LDATA_Bit0                     (0x0001U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_Bit1                     (0x0002U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_Bit2                     (0x0004U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_Bit3                     (0x0008U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_Bit4                     (0x0010U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_Bit5                     (0x0020U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_Bit6                     (0x0040U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_Bit7                     (0x0080U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_Bit8                     (0x0100U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_Bit9                     (0x0200U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_Bit10                    (0x0400U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_Bit11                    (0x0800U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_Bit12                    (0x1000U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_Bit13                    (0x2000U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_Bit14                    (0x4000U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_Bit15                    (0x8000U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LCHANNELSEL_Pos                (16)
#define  ADC_LDATA_LCHANNELSEL_Msk                (0xFU << ADC_LDATA_LCHANNELSEL_Pos)               /*!<Last Channel Selection*/
#define  ADC_LDATA_LCHANNELSEL                    ADC_LDATA_LCHANNELSEL_Msk
#define  ADC_LDATA_LCHANNELSEL_Bit0               (0x1U << ADC_LDATA_LCHANNELSEL_Pos) 
#define  ADC_LDATA_LCHANNELSEL_Bit1               (0x2U << ADC_LDATA_LCHANNELSEL_Pos) 
#define  ADC_LDATA_LCHANNELSEL_Bit2               (0x4U << ADC_LDATA_LCHANNELSEL_Pos) 
#define  ADC_LDATA_LCHANNELSEL_Bit3               (0x8U << ADC_LDATA_LCHANNELSEL_Pos) 
#define  ADC_LDATA_LOVERRUN_Pos                   (20)
#define  ADC_LDATA_LOVERRUN_Msk                   (0x1U << ADC_LDATA_LOVERRUN_Pos)                  /*!<Overrun Flag*/
#define  ADC_LDATA_LOVERRUN                       ADC_LDATA_LOVERRUN_Msk
#define  ADC_LDATA_LVALID_Pos                     (21)
#define  ADC_LDATA_LVALID_Msk                     (0x1U << ADC_LDATA_LVALID_Pos)                    /*!<Valid Flag*/
#define  ADC_LDATA_LVALID                         ADC_LDATA_LVALID_Msk
#define  ADC_LDATA_LCHANNELSEL_H_Pos              (22)
#define  ADC_LDATA_LCHANNELSEL_H_Msk              (0x1U << ADC_LDATA_LCHANNELSEL_H_Pos)             /*!<Use LCHANNELSEL_H together with LCHANNELSEL*/
#define  ADC_LDATA_LCHANNELSEL_H                  ADC_LDATA_LCHANNELSEL_H_Msk

/**
  * @brief ADC_TRGSUPR Register Bit Definition
  */
#define  ADC_TRGSUPR_TRG_SUP_CNT_Pos              (0)
#define  ADC_TRGSUPR_TRG_SUP_CNT_Msk              (0x7U << ADC_TRGSUPR_TRG_SUP_CNT_Pos)             /*!<Triggers the suppression count target*/
#define  ADC_TRGSUPR_TRG_SUP_CNT                  ADC_TRGSUPR_TRG_SUP_CNT_Msk
#define  ADC_TRGSUPR_TRG_SUP_CNT_Bit0             (0x1U << ADC_TRGSUPR_TRG_SUP_CNT_Pos) 
#define  ADC_TRGSUPR_TRG_SUP_CNT_Bit1             (0x2U << ADC_TRGSUPR_TRG_SUP_CNT_Pos) 
#define  ADC_TRGSUPR_TRG_SUP_CNT_Bit2             (0x4U << ADC_TRGSUPR_TRG_SUP_CNT_Pos) 
#define  ADC_TRGSUPR_TRG_SUP_EN_Pos               (7)
#define  ADC_TRGSUPR_TRG_SUP_EN_Msk               (0x1U << ADC_TRGSUPR_TRG_SUP_EN_Pos)              /*!<Trigger inhibition enable*/
#define  ADC_TRGSUPR_TRG_SUP_EN                   ADC_TRGSUPR_TRG_SUP_EN_Msk


#endif

